In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("sql-murder-mystery.db")

In [3]:
query = """
SELECT description
FROM crime_scene_report
WHERE date = "20180115" and type = "murder" and city = "SQL City"
"""
cursor = conn.cursor()
my_query = cursor.execute(query)
my_query.fetchall()

[('Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".',)]

In [4]:
query2 = """
SELECT name
FROM person
WHERE address_street_name LIKE "Northwestern Dr"
"""
pd.read_sql_query(query2, conn)

                    name
0              Muoi Cary
1         Norman Apolito
2         Morty Schapiro
3           Weldon Penso
4         Lasonya Wildey
5               Josh Shi
6            Cody Schiel
7          Dusty Sigafus
8           Val Portlock
9   Kristopher Lagerberg
10         Olevia Morena
11      Angelena Billman
12        Rashad Cascone
13       Willetta Lurvey
14         Homer Simpson
15      Allyson Lazenson
16    Vincenza Burkhardt
17        Freddie Ellzey
18            Abe Roeker
19       Fredia Billeter
20          Renata Faver
21           Alison Eska
22        Ivory Mcgrevey
23     Christena Saffell
24           Bonita Knie
25           Boris Bijou
26      Christian Pagano
27        Sophie Tiberio
28         Sammie Sengun
29        Shiloh Huntoon
30          Cyril Yongue
31            Yer Modest
32     Andera Kostelecky
33        Laurie Scronce
34     Courtney Bordeaux
35        Torie Thalmann
36          Del Tacderen
37       Donovan Yackley
38     Calvin Czelusniak
39         Kurtis Masuda
40             Donn Duin
41   Leonora Wolfsberger
42           Teri Ehrich
43       Kinsey Erickson
44     Dionna Kranwinkle
45        Emmitt Aceuedo
46           Galina Khuu
47         Coretta Cubie
48           Jonah Toner
49          Ivy Kazarian

In [5]:
query3 = """
SELECT name
FROM person
WHERE address_street_name LIKE "Franklin Ave"
"""
pd.read_sql_query(query3, conn)

                   name
0        Wilmer Wolever
1        Annabel Miller
2         Johnnie Schee
3         Carleen Etoll
4        Zachary Ybarbo
5            Gema Nantz
6       Clarita Rickels
7        Shelby Dezeeuw
8          Amado Mattan
9     Cordell Lindamood
10         Domenic Laun
11         Noe Pancoast
12     Katelyn Schwerin
13         Bev Billiter
14        Jordan Pelton
15             Ezra Phy
16       Yelena Whitler
17          Guy Bustard
18        Patty Wamsley
19       William Shiver
20        Lavette Koehl
21        Ronny Gumbert
22        Ricki Bidding
23      Laurine Bousman
24     Colette Hollomon
25       Isaiah Holsten
26      Mariah Lepetich
27       Renita Roperto
28        Hope Arzabala
29   Whitney Herkenratt
30  Sebastian Ramnarase
31         Ressie Razze
32          Graig Summy
33         Dante Eschen
34        Blake Chrones
35        Candice Train
36       Wilmer Casella
37          Maria Walsh
38       Edgar Mendieta
39          Moses Ikerd
40            Raul Eads
41        Omer Andreoni
42            Hong Lisa
43       Cameron Dilick
44        Jordan Myntti

In [6]:
query2 = """
SELECT *
FROM person p
JOIN drivers_license dl ON p.license_id = dl.id
"""
pd.read_sql_query(query2, conn)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076,993845,46,59,black,green,male,557472,Chrysler,Town & Country
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044,861794,54,74,black,white,female,3P6DMS,BMW,M Roadster
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512,385336,24,79,blue,green,female,GM6Y5J,Mercedes-Benz,CLS-Class
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061,431897,22,75,amber,red,female,461S1M,Ford,Ranger
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684,550890,45,60,blue,black,female,8030O8,Toyota,Tacoma Xtra
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10001,99936,Luba Benser,274427,680,Carnage Blvd,685095054,274427,26,55,green,blonde,female,3O06O3,Ford,Explorer
10002,99941,Roxana Mckimley,975942,1613,Gate St,512136801,975942,87,54,blue,white,female,PYO673,Volvo,XC70
10003,99965,Cherie Zeimantz,287627,3661,The Water Ave,362877324,287627,29,58,black,brown,female,Z784RR,Audi,S5
10004,99982,Allen Cruse,251350,3126,N Jean Dr,348734531,251350,66,61,blue,blonde,male,CJ2QC2,Buick,LaCrosse
10005,99990,Vance Hunten,830407,3056,Lancefield St,896677562,830407,61,76,green,white,male,H55UF5,Chevrolet,Silverado 3500